Conv_malla_15deg_253k/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

rho             [1 -3 0 0 0 0 0] 1.1764; // Interpolated Value of rho at T = 300 k, indif para incompresible

nu              [0 2 -1 0 0 0 0] 8.58025e-06; // calculated from Re=6 million, U= 51.4815, c=1

// ************************************************************************* //
